-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 30, 2023 at 12:17 PM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.1.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `msns`
--

-- --------------------------------------------------------

--
-- Table structure for table `affiliation`
--

CREATE TABLE `affiliation` (
  `Affiliation_id` int(3) UNSIGNED ZEROFILL NOT NULL,
  `Affiliation_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `affiliation`
--

INSERT INTO `affiliation` (`Affiliation_id`, `Affiliation_name`) VALUES
(001, 'กองกำลังต่อต้านปีศาจ\r\n'),
(002, 'พระเจ้าสายฟ้า\r\n');

-- --------------------------------------------------------

--
-- Table structure for table `bloodtype`
--

CREATE TABLE `bloodtype` (
  `BloodType_id` int(3) UNSIGNED ZEROFILL NOT NULL,
  `BloodType_name` varchar(5) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `bloodtype`
--

INSERT INTO `bloodtype` (`BloodType_id`, `BloodType_name`) VALUES
(001, 'A'),
(002, 'B'),
(003, 'O'),
(004, 'AB');

-- --------------------------------------------------------

--
-- Table structure for table `characters`
--

CREATE TABLE `characters` (
  `ch_id` int(3) UNSIGNED ZEROFILL NOT NULL,
  `ch_name` text NOT NULL,
  `Birthday` text NOT NULL,
  `Race` int(3) NOT NULL,
  `Gender` int(3) NOT NULL,
  `BloodType` int(3) NOT NULL,
  `Affiliation` int(3) NOT NULL,
  `Occupation` int(3) NOT NULL,
  `Ability` text NOT NULL,
  `Description` text NOT NULL,
  `Personality` text NOT NULL,
  `Appearance` text NOT NULL,
  `profile_img` text NOT NULL,
  `img1` text NOT NULL,
  `img2` text NOT NULL,
  `img3` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `characters`
--

INSERT INTO `characters` (`ch_id`, `ch_name`, `Birthday`, `Race`, `Gender`, `BloodType`, `Affiliation`, `Occupation`, `Ability`, `Description`, `Personality`, `Appearance`, `profile_img`, `img1`, `img2`, `img3`) VALUES
(001, 'Yuuki Wakura', 'วันที่ 12 มีนาคม', 1, 1, 1, 1, 6, 'Slave', 'ยูกิ วาคุระ (和倉 優希わくら ゆうき, Wakura Yūki) เป็นผู้ดูแลหน่วยต่อต้านปีศาจที่ 7 และเป็นตัวละครเอกชายของ Mato Seihei no Slave เขาเข้าเรียนที่โรงเรียนมัธยมคามิโนเกะในฐานะนักเรียนชั้นปีที่สาม แต่หลังจากจมอยู่ในภัยพิบัติมาโตะ เขาก็ได้รับการช่วยเหลือจากเคียวกะ อุเซ็น และกลายเป็นทาสของเธอ ทำให้เขามีพลังที่จะต่อสู้เคียงข้างเธอ', 'ตั้งแต่เริ่มต้น ยูกิได้แสดงให้เห็นว่าเป็นคนที่มีอุดมคติ ใจกว้าง และเอาใจใส่ เขาจะช่วยเหลือเพื่อนและพันธมิตรหากคนใดคนหนึ่งต้องการความช่วยเหลือ เขามีปัญหากับสถานการณ์ของโลกปัจจุบันที่ผู้ชายต้องยอมจำนนต่อผู้หญิง เพราะทุกคนสามารถได้รับพรจากการกินลูกพีชจากมาโตะ แต่ในขณะเดียวกันเขาก็ยังทำหน้าที่ของเขาต่อไป เขามีความปรารถนาอย่างแรงกล้าที่จะเป็นฮีโร่และปกป้องผู้คนที่ตกอยู่ในอันตราย ซึ่งทำให้เขามีศรัทธาต่อ Kyouka มากขึ้น ซึ่งสามารถช่วยเขาในการทำเช่นนั้นได้ จนถึงจุดที่ตกลงที่จะเป็นผู้ดูแลหน่วยที่ 7', 'เขาเป็นชายหนุ่มผมสีดำ ตาสีน้ำตาลเข้ม ส่วนสูงโดยเฉลี่ย มีผมสีขาวสองปอยเด่นจากไรผมตรงกลาง อยู่ที่ปลายยอดของหญิงม่าย ร่างกายปกติของเขาเริ่มพัฒนาไปสู่ความกระชับมากขึ้น อันเป็นผลมาจากการฝึกเป็นประจำและทำหน้าที่เป็นผู้ดูแลหน่วยที่ 7 ยูกิถูกมองว่าหล่อหรือน่ารักจากผู้หญิงหลายคนใน Anti-Demon Corps มากกว่าหนึ่งครั้ง', 'cha_647058935ee52.png', 'img1_647061d626f10.png', 'img2_647061d62710c.png', 'img3_647061d62beb3.png'),
(002, 'Kyouka Uzen', '4 กันยายน', 1, 2, 3, 1, 6, 'Slave', 'Kyouka Uzen (羽前 京香うぜん きょうか, Uzen Kyōka) เป็นหัวหน้าหน่วยต่อต้านปีศาจหน่วยที่ 7 และเป็นตัวเอกหญิงของมังงะเรื่อง Mato Seihei no Slave\r\n\r\nเดิมทีเธอเข้าร่วม Anti-Demon Corps หลังจากที่บ้านเกิดของเธอถูกทำลายโดยกลุ่ม Shuuki เมื่อหลายปีก่อน และตอนนี้พยายามที่จะล้างแค้นให้กับเพื่อนและครอบครัวของเธอด้วยการกำจัด Shuuki ทั้งหมดที่อาศัยอยู่ใน Mato', 'เหมาะที่จะเป็นหัวหน้าหน่วยที่ 7 Kyouka สามารถเป็นผู้หญิงที่มีความเข้มแข็งทางทหาร ใจเย็น และจริงจังที่ต่อสู้กับ Shuuki อย่างจริงจังมากกว่าสมาชิกคนอื่นๆ ของ Anti-Demon Corps เธอห่วงใยผู้อื่นอย่างสุดซึ้ง เช่น ผู้ใต้บังคับบัญชา พันธมิตร ยูกิ และพลเรือน ถึงขั้นทำทุกอย่างที่เป็นไปได้เพื่อปกป้องพวกเขาจนถึงจุดที่ดำดิ่งสู่สถานการณ์โดยไม่ลังเล เธอยังมีความทะเยอทะยานที่จะเป็นผู้บัญชาการคนต่อไปของ Anti-Demon Corps และแข่งขันกับหัวหน้าคนอื่น ๆ ที่กำลังมองหาตำแหน่งเดียวกัน', 'Kyouka เป็นหญิงสาวที่มีฐานะดีและมีผมสีเงินซึ่งยาวไปถึงต้นขา ผมของเธอมีหน้าม้าที่ด้านข้างของหน้าผากตรงกลาง ในขณะที่ผมสองเส้นยาวถึงไหล่ของเธอ และดวงตาสีชมพูซึ่งดูเหมือนกรีดตาของเธอ\r\n\r\nในฐานะหัวหน้าหน่วยที่ 7 เธอมักแต่งกายด้วยชุดเครื่องแบบต่อต้านปีศาจซึ่งประกอบด้วยเสื้อคลุมทหารสีน้ำเงินกรมท่า หมวกแก๊ปที่มีไฮไลท์สีแดง ถุงมือสีขาว กระโปรงสั้น รองเท้าบู๊ตสูงระดับต้นขา นอกจากนี้ Kyouka ยังมีเครื่องประดับที่ไม่เหมือนใครบนหูของเธอซึ่งมีลักษณะคล้ายเขาแบนสีน้ำเงินโค้งที่ยื่นออกมาจากผมของเธอ\r\n', 'cha_6470686755821.png', 'img1_64706867568be.png', 'img2_6470686757081.png', 'img3_647068675722b.png'),
(004, 'Himari Azuma', '28 สิงหาคม', 1, 2, 1, 1, 6, 'Learning', 'ฮิมาริ อาซึมะ (東 日万凛あずま ひまり, อาซึมะ ฮิมาริ) เป็นรองหัวหน้าหน่วยต่อต้านปีศาจหน่วยที่ 7 และเป็นตัวประกอบหลักของมังงะเรื่อง Mato Seihei no Slave\r\n\r\nเธอเป็นลูกสาวคนสุดท้องของตระกูล Azuma และถูกมองว่าล้มเหลวเมื่อเทียบกับพี่สาวที่มีความสามารถมากกว่าคนอื่นๆ ก่อนเข้าร่วมหน่วยที่ 7 หลังจากได้พบกับ Kyouka Uzen และต่อสู้เคียงข้างกับ Yuuki Wakura เนื่องจากความสามารถของ Slave ฮิมาริสามารถพิสูจน์คุณค่าของเธอต่อพี่น้องและครอบครัวของเธอที่ตอนแรกดูถูกเธอ', 'ฮิมาริถูกแนะนำตัวว่าเป็นคนห่างเหินและไม่ไว้ใจยูกิ วาคุระในช่วงแรกที่พบกัน เพราะเขาเป็นเพียงผู้ชายคนหนึ่ง ปฏิบัติต่อเขาเหมือนด้อยกว่าหน่วยที่ 7 และปฏิบัติต่อเขาเหมือนทาส แม้เชื่อว่าเขาควรจะรู้สึกขอบคุณที่เขา อยู่ที่นั่น. เธอมีทิฐิในตัวเอง พลังของเธอ และสมาชิกหน่วยที่ 7 มากกว่า Kyouka ที่เธอชื่นชม เพราะเธอโกรธง่าย\r\n\r\nแม้ว่าเธอจะเป็นศัตรูกับ Yuuki โดยมองว่าเขาเป็นเพียงทาส แต่เธอก็ยอมรับว่าเขาเป็นบุคคลที่มีความสามารถสูงทั้งในและนอกการต่อสู้ แต่ฮิมาริเป็นคนแรกที่โจมตีเขาเมื่อใดก็ตามที่เขาถูกจับได้ในสถานการณ์ที่ผิดปกติต่างๆ แม้จะบังเอิญ เช่น เห็นพวกเขาเปลือยกายในอ่างอาบน้ำหรือแต่งตัว\r\n\r\nเนื่องจากวัยเด็กอันโหดร้ายของเธอ เธอจึงทำงานหนัก ดังนั้นเธอจึงมักจะฝึกร่วมกับ Kyouka Uzen เกือบตลอดเวลาในการฝึกการต่อสู้และฝึกฝน Peach Blessing ของเธอ เธอไม่เคยละทิ้งความรับผิดชอบใด ๆ ของเธอหรือขัดคำสั่ง ตำหนิผู้อื่นที่ทำเช่นนั้นแทน อย่างไรก็ตาม เธอสามารถเป็นเลือดร้อนทั้งในและนอกการต่อสู้ได้ และถูกมองว่าเป็นหนึ่งในผู้ไม่เหมาะกับหน่วยที่ 7 ด้วยเหตุนี้ ฮิมาริจึงรู้สึกอายและโกรธได้ง่ายหากความสามารถหรือการฝึกฝนของเธอถูกตั้งคำถาม โดยเฉพาะพี่สาวของเธอ ยาชิโฮะ อาซึมะ เพราะความอ่อนแอของเธอ ความปรารถนาสูงสุดของเธอคือการเป็นฮีโร่ที่คล้ายกับยูกิ แต่ฮิมาริต้องการเป็นเหมือนเคียวกะและชดเชยทุกอย่างที่เธอไม่สามารถทำได้เมื่อเทียบกับพี่สาวของเธอ', 'ฮิมาริเป็นหญิงสาวผิวสีแทนอายุมากกว่ายูกิ วาคุระหนึ่งปี มีผมสีเขียวน้ำทะเลเข้มด้านหลังที่ผูกเป็นโบว์ที่ด้านหลังศีรษะ มีหน้าม้ายาวปัดไปทางด้านขวาของศีรษะและดวงตาสีเหลืองอำพัน .\r\n\r\nส่วนใหญ่แล้วเธอมักจะแต่งกายด้วยชุดเครื่องแบบของ Anti-Demon Corps ซึ่งประกอบด้วยชุดแขนสั้นสีน้ำเงินกรมท่า เข็มขัดสีแดง และรองเท้าบูทส้นสูงที่ยาวถึงต้นขา', 'cha_647073445656d.png', 'img1_6470734457ae3.png', 'img2_6470734457fee.png', 'img3_6470734458136.png'),
(005, 'Shushu Suruga', '13 พฤศจิกายน', 1, 2, 2, 1, 6, 'Paradigm Shift', 'Shushu Suruga ( 駿河 朱々するが しゅしゅ, Suruga Shushu) เป็นสมาชิกของ Anti-Demon Corps 7th Unit และเป็นตัวประกอบหลักของมังงะเรื่อง Mato Seihei no Slave', 'ชูชูเป็นเด็กสาวที่ร่าเริงและไม่เมินเฉย ไม่เหมือนกับสมาชิกส่วนใหญ่ในทีมของเธอ มักจะแสดงทั้งความคิดที่ร่าเริงและไม่เมินเฉยเกือบตลอดเวลา ต่างจากฮิมาริที่เกลียดยูกิในตอนแรก เธอเริ่มสนใจเขาเพราะเธอเข้าเรียนในโรงเรียนหญิงล้วนและไม่ค่อยมีปฏิสัมพันธ์กับเด็กผู้ชายคนอื่นที่อายุเท่าเธอมาก่อน ชูชูใช้ชีวิตแบบโลกีย์ โหยหาความตื่นเต้น เลือกที่จะเข้าร่วม Anti-Demon Corp เพียงเพื่อสิ่งเร้าเท่านั้น แต่เธอสามารถถูกยั่วยุได้ง่าย\r\n\r\nแม้จะมีท่าทีค่อนข้างกังวล แต่ Shushu ก็ค่อนข้างอายต่ออารมณ์ของเธอที่มีต่อ Yuuki โดยเลือกที่จะแกล้งเขาแบบอ้อมๆ แทนที่จะบอกเขาตรงๆ นอกจากนี้เธอยังปกป้องชายหนุ่มเป็นอย่างดี\r\n\r\nนอกจากนี้ ชูชูยังค่อนข้างไร้เดียงสาและอยากรู้อยากเห็นในทุกสิ่ง เธอชอบที่จะกระตือรือร้น เช่น อยากเห็นรูปร่างเปลือยเปล่าของผู้ชายด้วยความอยากรู้อยากเห็น', 'Shushu เป็นหญิงสาวที่มีฐานะดี ผมสั้นสีเหลือง มีโทนสีเขียวและดวงตาสีเขียวที่เข้าคู่กัน เธอมักจะเห็นเธอผูกริบบิ้นไว้บนผมในลักษณะที่พวกมันตั้งขึ้นเหมือนหูกระต่าย\r\n\r\nในฐานะสมาชิกของหน่วยที่ 7 เธอมักจะสวมเครื่องแบบของ Anti-Demon Corps ซึ่งประกอบด้วยเสื้อคลุมทหารแขนกุดสีกรมท่า ถุงมือยาวเลยข้อศอก เข็มขัดสีแดง กางเกงขาสั้น รองเท้าบูทส้นสูง ถึงต้นขาของเธอ', 'cha_647074ba1559b.png', 'img1_647074ba159cc.png', 'img2_647074ba15ca1.png', 'img3_647074ba15ddd.png'),
(006, 'Nei Ookawamura', '5 พฤษภาคม', 1, 2, 4, 1, 6, 'Promise', 'Nei Ookamura (大川村寧, Ōkawamura Nei) เป็นสมาชิกของหน่วยที่ 7 ซึ่งได้รับมอบหมายให้เป็นผู้เชี่ยวชาญด้านการสอดแนมแนวหลัง', 'เธอเป็นผู้หญิงที่ขยันและใจดีที่เข้ากับหน่วยที่ 7 ได้ง่าย รวมทั้งยูกิด้วยในการพบกันครั้งแรก แม้ว่าเธอจะยังเด็กและยังเป็นนักเรียนประถม แต่เธอก็สามารถเข้ากับยูกิได้อย่างง่ายดายในอีกระดับหนึ่ง ดูเหมือนว่าเธอจะลนได้ง่ายเมื่อเธอรู้สึกเขินอายหลังจากจูบยูกิที่แก้มซึ่งเป็นราคาของการใช้พลังของ Kyouk', 'เธอเป็นเด็กสาวที่มีผิวขาวสว่าง ผมยาวสีชมพูมีผ้าคาดผม และดวงตาสีฟ้า ในการประชุมที่สำคัญ จะเห็นเธอสวมเครื่องแบบของ Anti demon corp พร้อมกับคาดเข็มขัดสีแดงและกระโปรงยาว ในช่วงพักเบรกและสถานการณ์ฉุกเฉิน จะเห็นเธอสวมชุดลำลองขณะปฏิบัติงาน', 'cha_647075e8ad483.png', 'img1_647075e8ad7f2.png', 'img2_647075e8adba5.jpg', 'img3_647075e8addd1.jpg'),
(007, 'Tenka Izumo', '1 ตุลาคม', 1, 2, 1, 1, 5, 'Ame-no-Mitori', 'Tenka Izumo (出雲 天花いずも てんか, Izumo Tenka) เป็นหัวหน้าหน่วยต่อต้านปีศาจหน่วยที่ 6 และเป็นตัวประกอบหลักของมังงะเรื่อง Mato Seihei no Slave', 'เท็นกะเป็นผู้หญิงที่สุขุม เป็นผู้ใหญ่ และนิสัยดี ซึ่งสังเกตได้จากปฏิสัมพันธ์ของเธอในหน่วยที่ 7 ไม่ค่อยแสดงอะไรนอกจากท่าทางร่าเริงและจริงใจ แตกต่างจาก Yachiho เธอมั่นใจในความสามารถและหน่วยของเธอ แต่ไม่มั่นใจเกินไปและไม่เคยดูถูกคนอื่นเหมือนอย่างหลัง มีข้อสังเกตว่า Tenka เรียกผู้อื่นด้วยความรัก เช่น เรียก Kyouka ว่า \"Kyou-chin\" และ Yuuki ในตอนแรกว่า \"Slave-kun\"\r\n\r\nเช่นเดียวกับ Kyouka สมาชิกในหน่วยของเธอมองไปที่ Tenka และเธอก็ใส่ใจพวกเขา เธอไม่สนว่าจะมีฝ่ายใดแพ้ในการต่อสู้ ถือไว้เป็นบทเรียนสำหรับพวกเขา ให้คำแนะนำทั้งหมดหลังจากแพ้ เธอยินดีจะกระโดดเข้าไปช่วยชีวิตผู้ใต้บังคับบัญชาของเธอจากฝ่ายตรงข้าม\r\n\r\nเธอเริ่มสนใจยูกิโดยไม่ได้ดูถูกว่าเขาเป็นแค่คนหรือทาส ความรู้สึกเหล่านี้ก้าวหน้าขึ้นเมื่อเธอเห็นเขาต่อสู้และช่วยเหลือผู้อื่น ทำให้เธอรู้สึกแข็งแกร่งต่อเขา เธอเป็นคนหน้าด้านและตรงไปตรงมามากโดยสนใจเขา พยายามเกลี้ยกล่อมเขาหลังจากเพิ่งพบเขาเมื่อไม่นานมานี้ เธอมักจะจีบเขาคนเดียวหรือต่อหน้าคนอื่น แม้กระทั่งถาม Kyouka ว่าเธอขอ Yuuki ได้ไหม ในความเป็นจริง แม้ว่า Tenka จะไม่เคยแสดงความโกรธมาก่อน แต่เธอก็เกลียดความจริงที่ว่า Yuuki ถูกลักพาตัวไปโดย Shuuki ร่างมนุษย์ที่นำโดยพี่สาวของเขา ความรู้สึกของเธอนั้นทำให้เธออดไม่ได้ที่จะทำร้าย Aoba เพราะเธอรู้ว่าเธอมีความหมายต่อ Yuuki มากแค่ไหน แทนที่จะตีหน้าตาย เธอยังไม่ใช่คนที่จะเก็บความแค้นเอาไว้ด้วย เนื่องจากการโต้ตอบของเธอกับอาโอบะหลังจากการต่อสู้ของพวกเขาแสดงให้เห็นว่าเป็นมิตร แม้จะค่อนข้างเป็นพี่น้องกันก็ตาม', 'เธอเป็นหญิงสาวสวยที่มีฐานะดีที่มีดวงตาสีฟ้าและผมสีบลอนด์สั้นที่มีสีขาวบนหัวของเธอ\r\n\r\nในฐานะหัวหน้าหน่วยที่ 6 เธอมักแต่งกายด้วยเครื่องแบบต่อต้านปีศาจซึ่งประกอบด้วยเสื้อคลุมทหารสีน้ำเงินกรมท่า หมวกแก๊ปที่มีไฮไลท์สีแดง ถุงมือสีขาว กางเกงขาสั้น และรองเท้าบูทหุ้มข้อ เธอใส่ต่างหูสองชุดที่แตกต่างกัน ต่างหูเดี่ยวที่มีขนนกอยู่ที่หูข้างขวาและต่างหูจี้สีน้ำเงิน\r\n\r\nมักพบเห็น Tenka สวมชุดพลเรือนเมื่อไม่ได้เข้าประจำการ\r\n', 'cha_64707775bb655.png', 'img1_64707775bb82a.png', 'img2_64707775bbc6f.png', 'img3_64707775bbf06.png'),
(008, 'Ren Yamashiro', '11 กุมภาพันธ์', 1, 2, 3, 1, 9, 'Vairocana', 'Ren Yamashiro (山城 恋やましろ れん, Yamashiro Ren) เป็นหัวหน้าหน่วยที่ 10 ของหน่วยต่อต้านปีศาจ\r\nพันธมิตรของเธอเป็นที่นับถือในฐานะจุดสูงสุดของมนุษยชาติ Ren ไม่เพียงแต่สั่งการหน่วยที่ 10 เท่านั้น แต่ยังดำรงตำแหน่งหัวหน้าผู้บัญชาการของทั้งองค์กรอีกด้วย และถือเป็นอาวุธที่แข็งแกร่งที่สุดของพวกเขา', 'ทั้ง Tenka และ Kyouka อธิบายว่า Ren เป็น Demon Hunter ผู้รักชาติ ทำทุกอย่างเพื่อปกป้องบ้านเกิดของเธอ ตั้งแต่กำจัดทั้ง Aoba และ Humanoid Shuuki คนอื่นๆ ที่อาศัยอยู่ใน Hidden Village และทำงานอย่างใกล้ชิดกับนายกรัฐมนตรีของญี่ปุ่นเพื่อให้เกิดสันติภาพ .\r\n\r\nตามที่ Kyouka กล่าวไว้ Ren เป็นคนที่อยากรู้อยากเห็นอย่างไม่น่าเชื่อ เมื่อเธอสนใจใครบางคนหรือบางสิ่ง มันเป็นเรื่องลางร้ายซึ่งสังเกตเห็นได้เมื่อยูกิติดต่อกับเธอเป็นครั้งแรก เธอจะหาข้อแก้ตัวเพียงเพื่อใช้เวลากับสิ่งนั้น เห็นได้ดีที่สุดกับหัวหน้าหน่วยที่ 3 ที่ถูกลดบทบาทให้กลายเป็นของเล่นของเธอ\r\n\r\nเนื่องจากการเลี้ยงดูของเธอ Ren จึงมีความเชื่ออย่างมากในการพิสูจน์ตัวเองว่าเหนือกว่าผู้อื่น เช่นเดียวกับการทำทุกวิถีทางเพื่อให้แน่ใจว่าผู้คนจะเกรงกลัวเธอ เพลิดเพลินกับความแตกต่างระหว่างเธอและจุดแข็งของพวกเขา', 'เร็นเป็นหญิงสาวสวยที่มีผมสีดำที่มีริบบิ้นอยู่ทางด้านซ้ายของเธอโดยมีหน้าม้าสี่เหลี่ยมห้อยอยู่ทางด้านขวาและดวงตาสีม่วง\r\n\r\nเธอแต่งกายด้วยเครื่องแบบ Anti-Demon Corps ตามปกติ สวมกางเกงขาสั้นแทนกระโปรง ถุงมือสีขาวและเสื้อคลุม นอกเหนือไปจากถุงน่องและรองเท้าส้นสีดำ', 'cha_64707a6689bc2.png', 'img1_64707a668ac27.png', 'img2_64707a668ae82.png', 'img3_64707a668afeb.png'),
(009, 'Fubuki Azuma', '16 เมษายน', 1, 2, 1, 1, 8, 'Sunset', 'Fubuki Azuma (東風舞希, Azuma Fubuki) เป็นสมาชิกของ Anti-Demon Corps และเป็นหัวหน้าหน่วยที่ 9 เธอเป็นแม่ของลูกสาวหลายคน เช่น Yachiho และ Himari Azuma เอาชนะลูกสาวคนสุดท้องของเธอระหว่างงานเลี้ยง Azuma เพื่อตัดสินผู้นำตระกูล Azuma คนใหม่ Fubuki เป็นผู้ชนะ ด้วยเหตุนี้จึงเป็นการสืบทอดตำแหน่งต่อจากแม่ของเธอ', 'จากการปรากฏตัวครั้งแรก เธอแสดงให้เห็นว่าเป็นผู้หญิงที่สงบ ให้เกียรติ และทะเยอทะยาน เธอมีความภาคภูมิใจในตระกูล Azuma เป็นอย่างมาก เนื่องจากเธอต้องการที่นั่งผู้บัญชาการเพียงเพราะสมาชิกหลายคนในครอบครัวของเธอเคยดำรงตำแหน่งผู้บัญชาการ\r\nในฐานะผู้นิยมความสมบูรณ์แบบ Fubuki ค่อนข้างวิพากษ์วิจารณ์เกี่ยวกับผลลัพธ์ โดยยกย่องลูกสาวคนโตของเธอทุกคนที่มีพรสวรรค์และความสามารถในการเป็นนักล่าปีศาจ และวิจารณ์ลูกสาวคนสุดท้องของเธอซึ่งเธอมองว่าเป็นความล้มเหลวที่ไม่เข้ากับพี่สาวของเธอได้\r\n\r\nเมื่อใดก็ตามที่ฮิมาริเป็นกังวล ฟุบุกิไม่มีความรู้สึกแบบแม่ที่มีต่อลูกสาวของเธอ ถึงขั้นพูดว่าเธอจะต้อง \"วางเธอลง\" ถ้าเธอยังคงลากชื่อครอบครัวของพวกเขาให้สกปรก ซึ่งเป็นคำขู่ที่ฮิมาริรู้ว่าเป็นเรื่องจริง', 'ฟุบุกิเป็นผู้หญิงที่สวยและท้วม มีผมยาวสีน้ำเงินเข้มที่ม้วนผมเป็นเปียและดวงตาสีเหลือง\r\n\r\nเธอมักจะแต่งกายด้วยชุดเครื่องแบบ Anti-Demon Corps ตามปกติโดยเปิดดูส่วนบนของหน้าอกและสวมถุงมือยาว', 'cha_64708fa0aa344.png', 'img1_64708fa0aa4a6.png', 'img2_64708fa0aa7d0.png', 'img3_64708fa0aaa0b.png'),
(010, 'Shikoku', '???', 2, 2, 2, 2, 10, 'Snakes', 'ชิโกกุ (紫黒) เป็นหนึ่งใน Hachiraishin ซึ่งประกอบด้วยเทพเจ้าที่เรียกว่าผู้ปกครอง Shuuki', 'ชิโกกุเป็นคนช่างพูดที่มักจะล้อเลียนไรเรนด้วยเหตุผลหลายประการ จากความล้มเหลวในการเอาชนะ Tenka ต้องช่วยเหลือเขาและเยาะเย้ยแผนการเริ่มต้นของเขาในการต่อต้าน Anti-Demon Corps ซึ่งแตกต่างจาก Rairen ที่ค่อนข้างเป็นศัตรูกับมนุษย์จนถึงจุดที่ล้อเลียนสิ่งมีชีวิตทั้งสายพันธุ์ แม้แต่ Tenka ที่เกือบฆ่าเขา เธอพบว่ามนุษย์น่าสนใจ โดยใช้สมาร์ทโฟนและแสดงท่าทางสมัยใหม่ที่แตกต่างกัน', 'ชิโกกุดูเหมือนเด็กสาวน่ารักทั่วไป รูปร่างเตี้ย ผมยาวสีม่วงที่ประกอบด้วยปลายงู ตาที่กรีด เขี้ยวที่แหลมคม และรอยดำใกล้ปลายลิ้นของเธอ\r\n\r\nส่วนใหญ่แล้วจะเห็นเธอสวมชุดกิโมโนแบบญี่ปุ่นดั้งเดิมโดยมัดผมไว้ด้านหลังด้วยริบบิ้นสีแดง', 'cha_6473761b871f2.png', 'img1_6473761b8868b.png', 'img2_6473761b88cb5.png', 'img3_6473761b88fc2.png');

-- --------------------------------------------------------

--
-- Table structure for table `gender`
--

CREATE TABLE `gender` (
  `Gender_id` int(3) UNSIGNED ZEROFILL NOT NULL,
  `Gender_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `gender`
--

INSERT INTO `gender` (`Gender_id`, `Gender_name`) VALUES
(001, 'ชาย'),
(002, 'หญิง');

-- --------------------------------------------------------

--
-- Table structure for table `occupation`
--

CREATE TABLE `occupation` (
  `Occupation_id` int(3) UNSIGNED ZEROFILL NOT NULL,
  `Occupation_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `occupation`
--

INSERT INTO `occupation` (`Occupation_id`, `Occupation_name`) VALUES
(001, 'หน่วยที่ 1'),
(002, 'หน่วยที่ 2'),
(003, 'หน่วยที่ 3'),
(004, 'หน่วยที่ 5'),
(005, 'หน่วยที่ 6'),
(006, 'หน่วยที่ 7'),
(007, 'หน่วยที่ 8'),
(008, 'หน่วยที่ 9'),
(009, 'หน่วยที่ 10'),
(010, 'เทพเจ้าสายฟ้าทั้งแปด');

-- --------------------------------------------------------

--
-- Table structure for table `race`
--

CREATE TABLE `race` (
  `Race_id` int(3) UNSIGNED ZEROFILL NOT NULL,
  `Race_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `race`
--

INSERT INTO `race` (`Race_id`, `Race_name`) VALUES
(001, 'มนุษย์'),
(002, 'พระเจ้า'),
(003, 'ฮิวแมนนอยด์ ชูกิ');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `affiliation`
--
ALTER TABLE `affiliation`
  ADD PRIMARY KEY (`Affiliation_id`);

--
-- Indexes for table `bloodtype`
--
ALTER TABLE `bloodtype`
  ADD PRIMARY KEY (`BloodType_id`);

--
-- Indexes for table `characters`
--
ALTER TABLE `characters`
  ADD PRIMARY KEY (`ch_id`);

--
-- Indexes for table `gender`
--
ALTER TABLE `gender`
  ADD PRIMARY KEY (`Gender_id`);

--
-- Indexes for table `occupation`
--
ALTER TABLE `occupation`
  ADD PRIMARY KEY (`Occupation_id`);

--
-- Indexes for table `race`
--
ALTER TABLE `race`
  ADD PRIMARY KEY (`Race_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `affiliation`
--
ALTER TABLE `affiliation`
  MODIFY `Affiliation_id` int(3) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `bloodtype`
--
ALTER TABLE `bloodtype`
  MODIFY `BloodType_id` int(3) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `characters`
--
ALTER TABLE `characters`
  MODIFY `ch_id` int(3) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `gender`
--
ALTER TABLE `gender`
  MODIFY `Gender_id` int(3) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `occupation`
--
ALTER TABLE `occupation`
  MODIFY `Occupation_id` int(3) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `race`
--
ALTER TABLE `race`
  MODIFY `Race_id` int(3) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
